app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", " Hey my test first article"], ["content", " Hear hear hear "], ["created_at", 2016-12-27 20:03:38 UTC], ["updated_at", 2016-12-27 20:03:38 UTC]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "content" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["content", "So I'm starting a new blog   And here is what I'll write"], ["updated_at", 2016-12-27 21:11:56 UTC], ["id", 2]]